app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  <div class="comments">
    <% Post.order(created_at: :desc).all.each do |p| %>