app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("comment", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["comment", "How do you master the handstand?"], ["created_at", 2016-06-30 22:31:35 UTC], ["updated_at", 2016-06-30 22:31:35 UTC]]